# ------------------------------------------------ 
# 定数：constant
# 変数：variable
# 
# Rubyのルール：変数は小文字から、定数は大文字
# 
# receiver.gets
# ------------------------------------------------

f = File.open "reader.rb", "r"

# ------------------------------------------------
# 一行 
# ------------------------------------------------

# line = f.gets
# puts line

# ------------------------------------------------
# 最終行まで
# ※ nilはfalseとして扱う、それ以外をTrueとしている
# ------------------------------------------------

while line = f.gets
  puts line
end

f.close

